CSI API ETABS v1
cPropFrameSDShape.GetSolidCircle Method
 Retrieves property data for a solid circle shape in a section designer section
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSolidCircle(
	string Name,
	string ShapeName,
	ref string MatProp,
	ref string SSOverwrite,
	ref int Color,
	ref double XCenter,
	ref double YCenter,
	ref double Diameter,
	ref bool Reinf,
	ref int NumberBars,
	ref double Rotation,
	ref double Cover,
	ref string RebarSize,
	ref string MatRebar
)
Function GetSolidCircle (
	Name As String,
	ShapeName As String,
	ByRef MatProp As String,
	ByRef SSOverwrite As String,
	ByRef Color As Integer,
	ByRef XCenter As Double,
	ByRef YCenter As Double,
	ByRef Diameter As Double,
	ByRef Reinf As Boolean,
	ByRef NumberBars As Integer,
	ByRef Rotation As Double,
	ByRef Cover As Double,
	ByRef RebarSize As String,
	ByRef MatRebar As String
) As Integer
Dim instance As cPropFrameSDShape
Dim Name As String
Dim ShapeName As String
Dim MatProp As String
Dim SSOverwrite As String
Dim Color As Integer
Dim XCenter As Double
Dim YCenter As Double
Dim Diameter As Double
Dim Reinf As Boolean
Dim NumberBars As Integer
Dim Rotation As Double
Dim Cover As Double
Dim RebarSize As String
Dim MatRebar As String
Dim returnValue As Integer
returnValue = instance.GetSolidCircle(Name,
	ShapeName, MatProp, SSOverwrite,
	Color, XCenter, YCenter, Diameter,
	Reinf, NumberBars, Rotation, Cover,
	RebarSize, MatRebar)
int GetSolidCircle(
	String^ Name,
	String^ ShapeName,
	String^% MatProp,
	String^% SSOverwrite,
	int% Color,
	double% XCenter,
	double% YCenter,
	double% Diameter,
	bool% Reinf,
	int% NumberBars,
	double% Rotation,
	double% Cover,
	String^% RebarSize,
	String^% MatRebar
)
abstract GetSolidCircle :
        Name : string *
        ShapeName : string *
        MatProp : string byref *
        SSOverwrite : string byref *
        Color : int byref *
        XCenter : float byref *
        YCenter : float byref *
        Diameter : float byref *
        Reinf : bool byref *
        NumberBars : int byref *
        Rotation : float byref *
        Cover : float byref *
        RebarSize : string byref *
        MatRebar : string byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame section property that is a section designer section
ShapeName
Type: System.String
 The name of an existing solid circle shape in the specified frame section property
MatProp
Type: System.String
 The name of the material property for the shape
SSOverwrite
Type: System.String
 This is a blank string, Default, or the name of a defined stress-strain curve.
 If this item is a blank string or Default, the shape stress-strain curve is based on the assigned material property.
Color
Type: System.Int32
 The fill color assigned to the shape
XCenter
Type: System.Double
 The X-coordinate of the center of the shape in the section designer coordinate system. [L]
YCenter
Type: System.Double
 The Y-coordinate of the center of the shape in the section designer coordinate system. [L]
Diameter
Type: System.Double
 The diameter of the circle.[L]
Reinf
Type: System.Boolean
 This item is True when there is edge and corner reinforcing steel associated with the shape. The MatProp item must refer to a concrete material for this item to be True.
NumberBars
Type: System.Int32
 This item is visible only if the Reinf item is set to True. It is the number of equally spaced bars for the circular reinforcing.
Rotation
Type: System.Double
 The counter clockwise rotation of the shape from its default orientation. [deg]
Cover
Type: System.Double
 This item is visible only if the Reinf item is set to True. It is the clear cover for the specified rebar
RebarSize
Type: System.String
 This item is visible only if the Reinf item is set to True. It is the size of the reinforcing bar.
MatRebar
Type: System.String
 The material property for the edge and corner reinforcing steel associated with the shape. This item applies only when the MatProp item is a concrete material and the Reinf item is True.
Return Value
Type: Int32
 Returns zero if the property data is successfully retrieved; otherwise it returns a nonzero value
Remarks
See Also
Reference
cPropFrameSDShape Interface
ETABSv1 Namespace